isemaster/inkmetrics/idf/sdkconfig.defaults
# ESP32-S3-ePaper-1.54 (Waveshare, V2): 8 МБ флеша, без PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# наша раскладка разделов (см. partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# USB-сеть: прибор отдаёт хосту сетевую карту.
# ECM/RNDIS вместо NCM: Windows не ставит драйвер на наш NCM (CM_PROB_FAILED_INSTALL),
# а RNDIS для неё родной — TinyUSB сам подсовывает Windows нужный режим через MS-описания.
CONFIG_TINYUSB_NET_MODE_ECM_RNDIS=y
#CONFIG_TINYUSB_NET_MODE_NCM=y

# ВАЖНО: вторичная консоль на USB-Serial/JTAG занимает тот же USB-блок, что нужен
# TinyUSB (USB-OTG). С ней tinyusb_driver_install() возвращал ESP_ERR_TIMEOUT, и
# прошивка падала на старте — нашли по дампу паники (main.c:276, start_usb_net).
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n

# логи и задачи
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Максимальный уровень DEBUG: без него ESP_LOGD вырезан на этапе компиляции, и
# подробные логи сети (esp_netif/dhcps/tusb_net) в «чёрный ящик» не попадают —
# а именно они нужны, чтобы понять, почему хост не получает адрес по DHCP.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
# максимум не равен уровню по умолчанию, иначе DEBUG снова вырезается
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000

# Диагностика: если прошивка упадёт, дамп паники сохраняется в раздел coredump —
# его можно прочитать через esptool и расшифровать (esp-coredump), даже когда
# консоль недоступна (UART наружу не выведен, USB-CDC консоль запрещена с TinyUSB).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=n
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
# зависание тоже должно стать паникой с дампом, а не тихой остановкой
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Interrupt-watchdog. По умолчанию 300 мс — и на стирании флеша он срабатывает:
# esp_flash_erase_region держит кэш и прерывания выключенными на весь диапазон,
# стирание нескольких секторов подряд в 300 мс не укладывается. Прошивка уходила
# в цикл перезагрузок (169 загрузок подряд, причина сброса interrupt-wdt) и
# «чёрный ящик» оставался пустым. Оставляем запас на отладочные записи в флеш.
CONFIG_ESP_INT_WDT_TIMEOUT_MS=3000

# Диск прибора: он же выступает флешкой с setup.cmd внутри (см. docs/plan-usb-installer.md).
# Включаем класс MSC рядом с сетью — описатели задаём сами в usb_desc.c.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=512
CONFIG_TINYUSB_DESC_MSC_STRING="inkmetrics disk"
